
from cmath import isnan, nan, tan
import math
import pandas as pd
import numpy as np
import numpy as np
import matplotlib.pyplot as plt
 
# x轴刻度标签
# x_ticks = ['a', 'b', 'c', 'd', 'e', 'f']
x_ticks = ['300',
'400',
'500',
'700',
'800',
'1000',
'1250',
'1300',
'1400',
'1500',
'1600',
'1700',
'1800',
'1900',
'2000',
'2200',
'2300',
'2400',
'2500',
'2800',
'2900',
'3000',
'3200',
'3300',
'3400',
'3500',
'3600',
'3700',
'3800',
'4000',
'4100',
'4200',
'4300',
'4400',
'4500',
'4600',
'4700',
'4800',
'4900',
'5000'
]

# x轴范围（0, 1, ..., len(x_ticks)-1）
x = np.arange(len(x_ticks))
# 第1条折线数据
y1 = [0.72029,
0.716902,
0.669657,
0.508498,
0.566871,
0.907251,
0.75354,
0.75796,
1.084882,
1.029792,
0.952196,
1.157148,
0.621718,
1.296535,
1.037744,
0.944859,
1.503982,
1.518948,
2.197378,
1.786412,
1.921245,
2.641183,
2.250053,
2.354719,
3.328232,
3.374691,
2.736515,
2.919506,
3.229668,
3.150725,
3.492784,
3.468708,
3.603853,
3.832039,
4.087241,
4.087332,
4.242319,
5.290501,
5.185863,
5.005545
]
# 第2条折线数据
y2 = [1.728946673,
1.776144181,
1.810207309,
2.892085331,
2.151262358,
1.898610708,
2.082391919,
2.069653756,
3.149822417,
2.310622142,
2.951790044,
1.817048419,
3.595245257,
2.054339103,
3.49574346,
4.219769344,
3.150092184,
2.823926119,
3.60579978,
2.799247477,
4.827096011,
4.442157644,
2.904920229,
4.381320418,
4.778702455,
4.954027829,
4.525246735,
4.158977269,
4.669963791,
5.051828336,
4.740375969,
4.910221179,
5.190650922,
5.822763287,
5.632898394,
4.86562775,
5.485556251,
7.004245501,
7.339393675,
6.126453036
]
 
# 设置画布大小
plt.figure(figsize=(30, 9))
# 画第1条折线，参数看名字就懂，还可以自定义数据点样式等等。
plt.plot(x, y1, color='#FF0000', label='u-2σ', linewidth=3.0)
# 画第2条折线
plt.plot(x, y2, color='#00FF00', label='u+2σ', linewidth=3.0)

# 给第1条折线数据点加上数值，前两个参数是坐标，第三个是数值，ha和va分别是水平和垂直位置（数据点相对数值）。
for a, b in zip(x, y1):
    plt.text(a, b, '%0.2f'%b, ha='center', va= 'bottom', fontsize=0)
# 给第2条折线数据点加上数值
for a, b in zip(x, y2):
    plt.text(a, b, '%0.2f'%b, ha='center', va= 'bottom', fontsize=0)
#绘制网格线
plt.grid(color='b',linestyle='dotted',linewidth=0.5)
# 画水平横线，参数分别表示在y=3，x=0~len(x)-1处画直线。
# plt.hlines(3, 0, len(x)-1, colors = "#000000", linestyles = "dashed")
 
# 添加x轴和y轴刻度标签
plt.xticks([r for r in x], x_ticks, fontsize=10, rotation=20)
plt.yticks(fontsize=18)
 
# 添加x轴和y轴标签
plt.xlabel(u'Distance', fontsize=25)
plt.ylabel(u'RMS', fontsize=25)
 
# 标题
plt.title(u'TL460-S1-E1', fontsize=25)
 
# 图例
plt.legend(fontsize=18)
 
# 保存图片
plt.savefig('./figure.pdf', bbox_inches='tight')
# 显示图片
plt.show()
